# Setting up
----------------------

##  How to add your Conda environment to your jupyter notebook

- conda create --name your_env_name
- conda install -c anaconda ipykernel
- python -m ipykernel install --user --name=your_env_name

https://medium.com/@nrk25693/how-to-add-your-conda-environment-to-your-jupyter-notebook-in-just-4-steps-abeab8b8d084

# Install Graphlab in Conda env:

- The pip command needs to be modified to "pip2.7"
- https://turi.com/download/install-graphlab-create-command-line.html
- When configuring ipykernel use "python2.7" instead of "python"

# Download and install Turi Create official
- https://github.com/apple/turicreate#installation
- Turi Create user guide https://apple.github.io/turicreate/docs/userguide/
- Turi Create API documentation https://apple.github.io/turicreate/docs/api/

--------------------------

# Starting with very basics exs

In [1]:
import pandas as pd

In [7]:
df=pd.read_csv("./input/people-example.csv")

- column with full name

In [14]:
df["Full Name"]=df["First Name"]+" "+df["Last Name"]

In [13]:
df.head()

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper

- add 2 to age

In [18]:
df.age= df.age+2

In [19]:
df.head()

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   26       Bob Smith
1      Alice  Williams         Canada   25  Alice Williams
2    Malcolm      Jone        England   24    Malcolm Jone
3      Felix     Brown            USA   25     Felix Brown
4       Alex    Cooper         Poland   25     Alex Cooper

- ussing APPLY to standarize eeuu names

In [23]:
df.Country.value_counts()

United States    2
USA              1
England          1
Switzerland      1
Canada           1
Poland           1
Name: Country, dtype: int64

In [24]:
def transform(country):
    if country == "USA":
        return "United States"
    else:
        return country

In [27]:
df.Country = df.Country.apply(transform)